In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

### 값 추가 · 변경

In [2]:
# 샘플 데이터프레임 생성_1
df1 = sns.load_dataset('anagrams')
df1 = df1[df1.index %2 ==0].reset_index(drop=True)  # 인덱스가 짝수인 행만 사용
df1

   subidr    attnr  num1  num2  num3
0       1  divided     2   4.0     7
1       3  divided     3   5.0     6
2       5  divided     4   5.0     8
3       7  divided     5   4.5     6
4       9  divided     2   3.0     7
5      11  focused     6   5.0     6
6      13  focused     6   5.0     9
7      15  focused     8   8.0     7
8      17  focused     7   7.0     6
9      19  focused     5   6.0     6

In [3]:
# str.replace() : 문자열 내 일부 글자 치환
df1.attnr.str.replace('ed','e')

0    divide
1    divide
2    divide
3    divide
4    divide
5    focuse
6    focuse
7    focuse
8    focuse
9    focuse
Name: attnr, dtype: object

In [4]:
# replace() : 전체 문자열 치환 (매칭 안되는 값은 그대로 출력)
df1.num1.replace({2 : 'small', 4 : 'medium',  6 : 'big'})

0     small
1         3
2    medium
3         5
4     small
5       big
6       big
7         8
8         7
9         5
Name: num1, dtype: object

In [5]:
# 함수 및 apply 활용
def condition(x):  
    if x<5:
        return '5미만'
    elif x<7:
        return '5~7'
    else:
        return '7이상'
df1.num2.apply(condition)

0    5미만
1    5~7
2    5~7
3    5미만
4    5미만
5    5~7
6    5~7
7    7이상
8    7이상
9    5~7
Name: num2, dtype: object

In [6]:
# lambda 활용
df1.num3.apply(lambda x: x**2)

0    49
1    36
2    64
3    36
4    49
5    36
6    81
7    49
8    36
9    36
Name: num3, dtype: int64

In [7]:
# transform() : 주어진 함수에 따라 값 수정
df1.num1.transform([lambda x: np.log(x), np.sqrt])

   <lambda>      sqrt
0  0.693147  1.414214
1  1.098612  1.732051
2  1.386294  2.000000
3  1.609438  2.236068
4  0.693147  1.414214
5  1.791759  2.449490
6  1.791759  2.449490
7  2.079442  2.828427
8  1.945910  2.645751
9  1.609438  2.236068

In [8]:
# clip(lower, upper) : 최대/최소값을 기반으로 트리밍
df1.num2.clip(lower = 4.5, upper = 6.5)

0    4.5
1    5.0
2    5.0
3    4.5
4    4.5
5    5.0
6    5.0
7    6.5
8    6.5
9    6.0
Name: num2, dtype: float64

In [9]:
# eval(expression) : 문자열로 받아서 실행, 대부분의 구문을 분석해서 실행할 수 있음
df1.eval('num2 = num2 * 50')

   subidr    attnr  num1   num2  num3
0       1  divided     2  200.0     7
1       3  divided     3  250.0     6
2       5  divided     4  250.0     8
3       7  divided     5  225.0     6
4       9  divided     2  150.0     7
5      11  focused     6  250.0     6
6      13  focused     6  250.0     9
7      15  focused     8  400.0     7
8      17  focused     7  350.0     6
9      19  focused     5  300.0     6

In [10]:
# np.where(조건, True일 경우 반환, False일 경우 반환) 
np.where(df1.num2 < 5, '5미만', np.where(df1.num2<7, '5~7', '7이상'))

array(['5미만', '5~7', '5~7', '5미만', '5미만', '5~7', '5~7', '7이상', '7이상',
       '5~7'], dtype='<U3')

### 컬럼 추가, 변경, 정리, 삭제

In [11]:
# 샘플 데이터프레임 생성_2
dict2 = {'Name' : ['San Miguel','Sauvignon Blanc', 'Jinro', 'Mak Geolli'], 'Korean' : [60, 80, 70, 75], 'Math' : [90,80,80,50], 'Society' : [70, 90, 95, 90]}
df2 = pd.DataFrame(dict2)
df2

              Name  Korean  Math  Society
0       San Miguel      60    90       70
1  Sauvignon Blanc      80    80       90
2            Jinro      70    80       95
3       Mak Geolli      75    50       90

In [12]:
# 컬럼 추가 : 맨 오른쪽
df2['Science'] = [85, 75, 80, 65]
df2

              Name  Korean  Math  Society  Science
0       San Miguel      60    90       70       85
1  Sauvignon Blanc      80    80       90       75
2            Jinro      70    80       95       80
3       Mak Geolli      75    50       90       65

In [13]:
# insert(위치, 컬럼명, 값 또는 seq) : n번째 위치에 컬럼 추가
df2.insert(3, 'English', [60, 70, 80, 90])
df2

              Name  Korean  Math  English  Society  Science
0       San Miguel      60    90       60       70       85
1  Sauvignon Blanc      80    80       70       90       75
2            Jinro      70    80       80       95       80
3       Mak Geolli      75    50       90       90       65

In [14]:
# split() : 컬럼 쪼개기
df2[['First_name', 'Last_name']] = df2.Name.str.split(' ', expand=True)
df2

,Name,Korean,Math,English,Society,Science,First_name,Last_name
0,San Miguel,60,90,60,70,85,San,Miguel
1,Sauvignon Blanc,80,80,70,90,75,Sauvignon,Blanc
2,Jinro,70,80,80,95,80,Jinro,None
3,Mak Geolli,75,50,90,90,65,Mak,Geolli

In [15]:
# 원하는 컬럼만 남기거나 순서 변경하기. columns()로 출력 후 복사해서 사용
df2 = df2[['Name', 'Korean', 'Math', 'Society', 'English', 'First_name', 'Last_name']]
df2

              Name  Korean  Math  Society  English First_name Last_name
0       San Miguel      60    90       70       60        San    Miguel
1  Sauvignon Blanc      80    80       90       70  Sauvignon     Blanc
2            Jinro      70    80       95       80      Jinro      None
3       Mak Geolli      75    50       90       90        Mak    Geolli

In [16]:
# 컬럼 앞뒤 맞바꾸기
col1 = df2.columns[-2:].to_list()
col2 = df2.columns[:-2].to_list()
df2 = df2[col1 + col2]
df2

  First_name Last_name             Name  Korean  Math  Society  English
0        San    Miguel       San Miguel      60    90       70       60
1  Sauvignon     Blanc  Sauvignon Blanc      80    80       90       70
2      Jinro      None            Jinro      70    80       95       80
3        Mak    Geolli       Mak Geolli      75    50       90       90

In [17]:
# 컬럼 순서를 거꾸로 
df2 = df2[reversed(df2.columns)]
df2

   English  Society  Math  Korean             Name Last_name First_name
0       60       70    90      60       San Miguel    Miguel        San
1       70       90    80      80  Sauvignon Blanc     Blanc  Sauvignon
2       80       95    80      70            Jinro      None      Jinro
3       90       90    50      75       Mak Geolli    Geolli        Mak

In [18]:
# List Comprehension : 서로 맞바꾸기
df2[['First_name' if c == 'Last_name' else 'Last_name' if c=='First_name' else c for c in df2.columns]]

   English  Society  Math  Korean             Name First_name Last_name
0       60       70    90      60       San Miguel        San    Miguel
1       70       90    80      80  Sauvignon Blanc  Sauvignon     Blanc
2       80       95    80      70            Jinro      Jinro      None
3       90       90    50      75       Mak Geolli        Mak    Geolli

In [19]:
# 특정 컬럼 앞으로 보내기
df2 = df2[['Society'] + [i for i in df2.columns.to_list() if i != 'Society']]
df2

   Society  English  Math  Korean             Name Last_name First_name
0       70       60    90      60       San Miguel    Miguel        San
1       90       70    80      80  Sauvignon Blanc     Blanc  Sauvignon
2       95       80    80      70            Jinro      None      Jinro
3       90       90    50      75       Mak Geolli    Geolli        Mak

In [20]:
# 컬럼 삭제하기
df2.drop(['First_name'], axis=1, inplace=True)
del df2['Last_name']
df2

C:\Users\홍련\AppData\Local\Temp\ipykernel_13060\1452723961.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop(['First_name'], axis=1, inplace=True)

   Society  English  Math  Korean             Name
0       70       60    90      60       San Miguel
1       90       70    80      80  Sauvignon Blanc
2       95       80    80      70            Jinro
3       90       90    50      75       Mak Geolli

In [21]:
# rename(columns = {}) : 컬럼명 변경하기
df2 = df2.rename(columns = {'Korean' : '국어', 'Math' : '수학'})
df2

   Society  English  수학  국어             Name
0       70       60  90  60       San Miguel
1       90       70  80  80  Sauvignon Blanc
2       95       80  80  70            Jinro
3       90       90  50  75       Mak Geolli

In [22]:
# 컬럼명 일괄 변경, 갯수 맞아야 함
df2.columns = ['사회', '영어', '수학', '국어', '이름']
df2

   사회  영어  수학  국어               이름
0  70  60  90  60       San Miguel
1  90  70  80  80  Sauvignon Blanc
2  95  80  80  70            Jinro
3  90  90  50  75       Mak Geolli

### 변수 타입 변경

In [23]:
# 샘플 데이터프레임 생성_3
dict3 = {'ipo' : ['제이오', '오아시스', '나노팀'], 
         'date' : ['20230208', '20230216', '20230221'],
         'deposit' : ['52,000', '-', '26,700'],
         'rate' : [142.47, 0, 1637.43]}
df3 = pd.DataFrame(dict3)
print(df3.dtypes)
df3

ipo         object
date        object
deposit     object
rate       float64
dtype: object

    ipo      date deposit     rate
0   제이오  20230208  52,000   142.47
1  오아시스  20230216       -     0.00
2   나노팀  20230221  26,700  1637.43

In [24]:
# astype() : 컬럼 타입 변경
df3.rate.astype(int)  # int | int8~64 | float | float16~64 | complex | str | category | bool

0     142
1       0
2    1637
Name: rate, dtype: int32

In [25]:
# 복수컬럼 타입 변경
df3.astype({'date' : 'int32', 'deposit' : str})

    ipo      date deposit     rate
0   제이오  20230208  52,000   142.47
1  오아시스  20230216       -     0.00
2   나노팀  20230221  26,700  1637.43

In [26]:
# to_numeric(컬럼명, errors) : 숫자형으로 변경, dtype() 과 달리 시리즈만 가능
pd.to_numeric(
    df3.deposit.str.replace(',', ''),  # 변경할 컬럼
    errors = 'coerce',  # ignore : 변경 불가하면 원본 반환 | coerce : 변경 불가하면 NaN으로 반환 | *raise : 변경 불가하면 에러
    downcast = 'float'  # 메모리 절약, integer | signed | unsigned | float
)

0    52000.0
1        NaN
2    26700.0
Name: deposit, dtype: float32

In [27]:
# to_datetime() : 날짜 타입으로 변경
df3['date2'] = pd.to_datetime(
    df3.date
)
df3

    ipo      date deposit     rate      date2
0   제이오  20230208  52,000   142.47 2023-02-08
1  오아시스  20230216       -     0.00 2023-02-16
2   나노팀  20230221  26,700  1637.43 2023-02-21

In [28]:
# 날짜 타입으로 변경
from datetime import datetime
df3.date.apply(lambda x:datetime.strptime(x, '%Y%m%d'))

0   2023-02-08
1   2023-02-16
2   2023-02-21
Name: date, dtype: datetime64[ns]

In [29]:
# 날짜 타입에서는 손쉽게 년/월/일 추출 가능
df3.date2.dt.day

0     8
1    16
2    21
Name: date2, dtype: int64

In [30]:
# 8자리 숫자로 변경
df3.date2.apply(lambda x: datetime.strftime(x, '%Y%m%d')).astype(int)

0    20230208
1    20230216
2    20230221
Name: date2, dtype: int32

### 결측값 확인, 삭제, 보간

In [31]:
# 샘플 데이터프레임 생성_4
col = ['spring', 'summer', 'fall', 'winter']
row = ['apple', 'peach', 'melon', 'strawberry', 'chestnut']
data = [[6, pd.NA, 8, 7],
                [4, 9, 5, np.nan],
                [5, 5, 5, 5],
                [None, 3, 6, 10],
                [None, None, None, None]]
df4 = pd.DataFrame(data, row, col)
df4

            spring summer  fall  winter
apple          6.0   <NA>   8.0     7.0
peach          4.0      9   5.0     NaN
melon          5.0      5   5.0     5.0
strawberry     NaN      3   6.0    10.0
chestnut       NaN   None   NaN     NaN

In [32]:
# isna() : 결측값 여부 확인
df4.isna()

            spring  summer   fall  winter
apple        False    True  False   False
peach        False   False  False    True
melon        False   False  False   False
strawberry    True   False  False   False
chestnut      True    True   True    True

In [33]:
# dropna() : 결측값 제거
df4.dropna(subset = ['summer', 'fall'],  # 결측값 여부 체크할 컬럼, 생략시 전체
          how = 'any',  # any: 결측값 하나라도 있는 경우, all: 모두 결측값인 경우, 기본값 any
          axis = 0,  # 0: 행 기준, 1: 열 기준, 기본값 0
          )

            spring summer  fall  winter
peach          4.0      9   5.0     NaN
melon          5.0      5   5.0     5.0
strawberry     NaN      3   6.0    10.0

In [34]:
# fillna() : 결측값 보간
df4.fillna(method = 'ffill',  # 결측값 변경 방식, *ffill: na 앞의 값으로 채움, bfill: na 뒤의 값으로 채움
          axis = 0,  # *0: 행 기준 | 1: 열 기준
          limit = 1,  # 결측값 변경할 횟수제한, 미지정시 무제한
          downcast = 'infer'  # float64를 int64로 변경
          )

            spring summer  fall  winter
apple          6.0   <NA>     8       7
peach          4.0      9     5       7
melon          5.0      5     5       5
strawberry     5.0      3     6      10
chestnut       NaN      3     6      10

In [35]:
# 특정 값으로 결측값 채우기
df4.fillna(0)

            spring  summer  fall  winter
apple          6.0       0   8.0     7.0
peach          4.0       9   5.0     0.0
melon          5.0       5   5.0     5.0
strawberry     0.0       3   6.0    10.0
chestnut       0.0       0   0.0     0.0

In [36]:
# 컬럼별로 다르게 결측값 채우기
df4.fillna({'spring':'A', 'summer':'B', 'fall':'C', 'winter':'D'})

           spring summer fall winter
apple         6.0      B  8.0    7.0
peach         4.0      9  5.0      D
melon         5.0      5  5.0    5.0
strawberry      A      3  6.0   10.0
chestnut        A      B    C      D

### 중복 확인, 삭제

In [37]:
# 샘플 데이터프레임 생성_5
col = ['col1', 'col2', 'col3']
data = [['A', '가', 1],
                ['A', '가', 1],
                ['A', '나', 2],
                ['B', '나', 3],
                ['B', '나', 4]]
df5 = pd.DataFrame(data, columns = col)
df5

  col1 col2  col3
0    A    가     1
1    A    가     1
2    A    나     2
3    B    나     3
4    B    나     4

In [38]:
# duplicated() : 중복행 확인
df5.duplicated(
    subset = ['col1', 'col2'],  # 지정한 열 기준으로 중복여부 확인, 미지정시 행 전체
    keep = 'first'  # 확인 방향, *first : 위에서부터 확인 후 중복인 행 나오면 True | last : 아래에서부터 확인
)

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [39]:
# drop_duplicates() : 중복행 제거
df5.drop_duplicates(
    subset = ['col1', 'col2'],  # 지정한 열 기준으로 중복여부 확인, 미지정시 행 전체
    keep = 'first',  # 중복제거 시 남길 행, *first : 첫값 남김 | last : 마지막값 남김
    inplace = False,  # 원본 변경 여부, True | *False
    ignore_index = False  # 기존 인덱스 무시하고 새로 채번, True | *False
)

  col1 col2  col3
0    A    가     1
2    A    나     2
3    B    나     3

In [40]:
# 샘플 데이터프레임 생성_6
df6 = pd.DataFrame(np.random.randint(1,101,(6,2)), index=pd.date_range('20230620', periods=6), columns= ['col1','col2'])
df6

            col1  col2
2023-06-20    70     3
2023-06-21    50    25
2023-06-22    68    21
2023-06-23    79    53
2023-06-24    71    39
2023-06-25    10    65

In [41]:
# diff() : 연속된 두행 간 차이를 구함
df6['col1_diff'] = df6.col1.diff()
df6

            col1  col2  col1_diff
2023-06-20    70     3        NaN
2023-06-21    50    25      -20.0
2023-06-22    68    21       18.0
2023-06-23    79    53       11.0
2023-06-24    71    39       -8.0
2023-06-25    10    65      -61.0

In [42]:
# shift() : 데이터프레임의 인덱스를 이동. 시계열 데이터에 유용
df6.shift(1, fill_value=1)

            col1  col2  col1_diff
2023-06-20     1     1        1.0
2023-06-21    70     3        NaN
2023-06-22    50    25      -20.0
2023-06-23    68    21       18.0
2023-06-24    79    53       11.0
2023-06-25    71    39       -8.0

In [43]:
# diff() 와 결과 동일
df6['col1_gap'] = df6.col1 - df6.col1.shift(1)
df6

            col1  col2  col1_diff  col1_gap
2023-06-20    70     3        NaN       NaN
2023-06-21    50    25      -20.0     -20.0
2023-06-22    68    21       18.0      18.0
2023-06-23    79    53       11.0      11.0
2023-06-24    71    39       -8.0      -8.0
2023-06-25    10    65      -61.0     -61.0

In [44]:
# pct_change() : # 연속된 두행 간 비율을 구함
df6['col1_ratio'] = df6.col1.pct_change()
df6

            col1  col2  col1_diff  col1_gap  col1_ratio
2023-06-20    70     3        NaN       NaN         NaN
2023-06-21    50    25      -20.0     -20.0   -0.285714
2023-06-22    68    21       18.0      18.0    0.360000
2023-06-23    79    53       11.0      11.0    0.161765
2023-06-24    71    39       -8.0      -8.0   -0.101266
2023-06-25    10    65      -61.0     -61.0   -0.859155

In [45]:
# pct_change() 와 결과 동일
df6['col1_rt'] = df6.col1 / df6.col1.shift(1) - 1
df6

            col1  col2  col1_diff  col1_gap  col1_ratio   col1_rt
2023-06-20    70     3        NaN       NaN         NaN       NaN
2023-06-21    50    25      -20.0     -20.0   -0.285714 -0.285714
2023-06-22    68    21       18.0      18.0    0.360000  0.360000
2023-06-23    79    53       11.0      11.0    0.161765  0.161765
2023-06-24    71    39       -8.0      -8.0   -0.101266 -0.101266
2023-06-25    10    65      -61.0     -61.0   -0.859155 -0.859155

In [46]:
# rolling() : 일정 크기의 창(window)를 이용하여 추가 메서드를 통해 계산. parameter 많으니 필요시 검색
df6.col2.rolling(window=3).sum()

2023-06-20      NaN
2023-06-21      NaN
2023-06-22     49.0
2023-06-23     99.0
2023-06-24    113.0
2023-06-25    157.0
Freq: D, Name: col2, dtype: float64

In [47]:
# expanding() : 해당 연산을 누적으로 진행
df6.col2.expanding().sum()

2023-06-20      3.0
2023-06-21     28.0
2023-06-22     49.0
2023-06-23    102.0
2023-06-24    141.0
2023-06-25    206.0
Freq: D, Name: col2, dtype: float64

### 집계 행/열 추가

In [48]:
# 데이터프레임 재활용
df7 = pd.DataFrame(dict2)
df7

              Name  Korean  Math  Society
0       San Miguel      60    90       70
1  Sauvignon Blanc      80    80       90
2            Jinro      70    80       95
3       Mak Geolli      75    50       90

In [49]:
# 컬럼 합계 추가
df7['Sum'] = df7.sum(axis=1, numeric_only=None)
df7

C:\Users\홍련\AppData\Local\Temp\ipykernel_13060\2238453994.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df7['Sum'] = df7.sum(axis=1, numeric_only=None)

              Name  Korean  Math  Society  Sum
0       San Miguel      60    90       70  220
1  Sauvignon Blanc      80    80       90  250
2            Jinro      70    80       95  245
3       Mak Geolli      75    50       90  215

In [50]:
# 행 평균 추가
df7.set_index('Name', inplace=True)  # 숫자만 남도록 문자부분 인덱스 지정, 필요시 인덱스 다시 해제
df7.loc['Avg'] = df7.mean(axis=0)
df7

                 Korean  Math  Society    Sum
Name
San Miguel        60.00  90.0    70.00  220.0
Sauvignon Blanc   80.00  80.0    90.00  250.0
Jinro             70.00  80.0    95.00  245.0
Mak Geolli        75.00  50.0    90.00  215.0
Avg               71.25  75.0    86.25  232.5